#!/bin/bash
# ******************************************************************************
# * Перекодирует перевод EU4 для его вывода модифицированными шрифтами по карте
# * безопасной кодировки
# * Установите свои значения в секции «ПЕРЕМЕННЫЕ» перед использованием.
# * Скрипт работает только с Lite-переводом.
# * Рекомендуется каждый раз при выходе новой версии игры заново копировать
# * файлы, которые не должны быть переведены.
# ******************************************************************************

########## ПЕРЕМЕННЫЕ
# файлы в указанном каталоге будут изменены

loc='' # каталог с локализацией

########## ДЕЙСТВИЯ

# очистка места для кириллицы
find "$loc" -type f -print0 | xargs -0 -I{} -P$(nproc) -n1 sed -i "s/€//g;s/‚/'/g;s/ƒ//g;s/„/\"/g;s/…/.../g;s/†//g;s/‡//g;s/ˆ//g;s/‰//g;s/‹/'/g;s/‘/'/g;s/’/'/g;s/“/\"/g;s/”/\"/g;s/•//g;s/–/-/g;s/—/-/g;s/˜//g;s/™//g;s/›/'/g;s/ / /g;s/¢//g;s/¥//g;s/¦//g;s/¨//g;s/©//g;s/ª//g;s/«/\"/g;s/¬//g;s/®//g;s/¯//g;s/°//g;s/±//g;s/²//g;s/³//g;s/´//g;s/µ//g;s/¶//g;s/·//g;s/¸//g;s/¹//g;s/º//g;s/»/\"/g;s/¼//g;s/½//g;s/¾//g;s/×//g;s/÷//g;" \{}
# замена кириллицы в юникоде на кириллицу в модифицированной кодировке
find "$loc" -type f -print0 | xargs -0 -I{} -P$(nproc) -n1 sed -i 'y/АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя/A€B‚ƒEË„…†‡KˆMHO‰PCT‹‘X’“”•–—˜™›×a ¢¥¦eë¨©ª«¬®¯°o±pc²³´xµ¶·¸¹º»¼¾÷/' \{}
# выход
exit 0
